Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །ཀཽ་ཌི་ནྱ་དེ་ལ་འདོད་པའི་སྲེད་པ་རྣམས་གང་ཞེ་ན།
en: “Kauṇḍinya, what are the forms of craving related to the desire realm?

source: འདོད་པ་རྣམས་ཞེས་བྱ་བ་ནི་འཁྲིག་པ་དང་ལྡན་པའི་སྤྲོད་པ་སྟེ།
en: Desire refers to sexual intercourse.

source: གང་ལ་བག་མེད་པ་རྣམས་འདོད་པའི་བདེ་བའི་སྦྱོར་བ་ལ་བརྩོན་ཞིང་དམན་པའི་རང་བཞིན་ཅན་གྱི་མི་དག་དགའ་བར་བྱེད་ཅིང་།
en: Careless beings strive to experience sensual pleasures, and humans with base natures delight in them.

source: སེམས་ཅན་རྣམས་འདོད་ཆགས་ཀྱིས་ཡོངས་སུ་གདུང་བས་གདུངས་ནས་འདོད་ཆགས་ཀུན་འབྱུང་བས་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་བྱེད་པའོ།
en: All forms of attachment will develop in sentient beings who are tormented by lustful longing. Those beings will therefore adopt the paths of the ten nonvirtuous actions and abide by it.

source: །རྒྱུ་དེ་དང་རྐྱེན་དེས་སེམས་ཅན་དམྱལ་བ་རྣམས་སྣང་ངོ་། །དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། གནོད་སྦྱིན་དབུལ་པོ་ཉིད་སྣང་ངོ་།
en: Through such causes and conditions, the hell realms, the animal realms, the World of the Lord of Death, and the abodes of the destitute yakṣas will manifest.

source: །འདོད་ཆགས་ཀྱི་རྒྱུས་སེམས་ཅན་རྣམས་འགྲོ་བ་ལྔ་དང་ལྡན་པའི་འཁོར་བར་སྡུག་བསྔལ་གྱི་ཚོར་བ་མི་བཟད་པ་རྩུབ་པ་རྣམ་པ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ། །སྐྲག་པར་མི་འགྱུར་རོ།
en: Due to attachment, sentient beings will experience a variety of harsh and unbearable sufferings within the five destinies of saṃsāra, and yet they will not be afraid of attachment.

source: །དེ་དག་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་སྤངས་ཤིང་དགེ་བའི་རྩ་བ་དང་བྲལ་བས་བརྒྱ་ལམ་ན་རེས་འགའ་མི་ཉིད་རྙེད་པར་འགྱུར་རོ།
en: Since they have abandoned humility and modesty, and since they are disconnected from roots of virtue, they will only very rarely obtain a human body.

source: །དེ་དག་འདོད་ཆགས་ཀྱི་རྒྱུས་ཡང་དང་ཡང་དུ་ལུས་དང་ངག་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པའི་ལས་རྣམ་པ་སྣ་ཚོགས་ཞེས་བྱ་བ་ནས་མཚམས་མེད་པའི་ལས་རྣམས་ཞེས་བྱ་བའི་བར་ཀུན་ནས་སློང་བར་བྱེད་དོ།
en: Due to attachment, they will repeatedly engage in various physical, verbal, and mental unwholesome actions—up to the acts with immediate retribution.

source: །དེ་དག་ཡང་དང་ཡང་དུ་དུས་ཡུན་རིང་པོར་ངན་སོང་རྣམས་སུ་ཚོར་བ་རྩུབ་པ་མི་བཟད་པ་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: They will, repeatedly and for long periods of time, experience harsh and unbearable feelings in the lower realms.

source: །ཐམས་ཅད་ཀྱང་འདོད་ཆགས་ཀྱི་རྒྱུ་དང་འདོད་ཆགས་ཀྱི་གཞིས་འདོད་ཆགས་ཀྱི་བག་ལ་ཉལ་གྱི་ལྟུང་བ་བརྟགས་པ་དག་ཡིན་ཏེ།
en: Since these are all caused by and based on attachment, they are referred to as the downfalls stemming from the latent propensities of attachment.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འདོད་ཆགས་སྤངས་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བར་མཛད་དོ། །སེམས་ཅན་དེ་དག་འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཤེས་ནས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོགས་པར་བྱེད་དེ།
en: “Therefore, the Thus-Gone One teaches the Dharma so that beings will abandon attachment. He sees the defects of the various desires as they are, and so he causes beings to understand and genuinely realize the defects of those desires.

source: དཔེར་ན་འདོད་པ་རྣམས་ནི་མི་སྡུག་པ་དག་གོ། །ཀིམ་པ་ཀའི་འབྲས་བུ་ལྟ་བུ་དག་གོ། །འདོད་པ་རྣམས་ནི་མེ་མདག་གི་ཕུང་པོ་ལྟ་བུ་དག་གོ། །དུག་གི་བུམ་པ་ལྟ་བུ་དག་གོ། །འདོད་པ་རྣམས་ནི་མནམ་ཕྱི་ས་དང་འདྲ་བ་དག་གོ། །འདོད་པ་རྣམས་ནི་སྤུ་གྲིའི་སོ་ལྟ་བུ་དག་གོ། །ཆོམ་རྐུན་ལྟ་བུ་དག་གོ། །གདོལ་པའི་ཁྱིམ་ལྟ་བུ་དག་གོ། །ལྕགས་ཀྱི་ཐུ་ལུམ་འབར་བ་ལྟ་བུ་དག་གོ། །སེར་བ་འབབ་པ་ལྟ་བུ་དག་གོ། །སྦྲུལ་གདུག་པ་ལྟ་བུ་དག་གོ། །དགྲ་དང་འདྲ་བ་དག་གོ། །དགོན་པའི་ལམ་ལྟ་བུ་དག་གོ། །སྲིན་མོའི་གླིང་ལྟ་བུ་དག་གོ། །གཤེད་མ་ལྟ་བུ་དག་གོ། །ཕྱག་དར་ལྟ་བུ་དག་གོ།
en: He causes them to understand that desires are repulsive like kimpaka fruits, heaps of glowing embers, vases filled with poison, stinking excrement, the edges of razor blades, thieves, the houses of outcastes, blazing iron lumps, hailstones, poisonous snakes, enemies, desolate roads, islands of rākṣasīs, executioners, rubbish, or charnel grounds.

source: །འདོད་པ་རྣམས་ནི་དུར་ཁྲོད་ལྟ་བུ་དག་ཏུ་ཤེས་ཤིང་འདོད་པ་ལ་ཆགས་པ་དང་། འདོད་པ་ལ་ཞེན་པ་དང་། འདོད་པའི་ཡོངས་སུ་གདུང་བ་དང་། འདོད་པའི་ཀུན་འབྱུང་བ་དང་། འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཤེས་ཏེ།
en: He causes them to understand the defects associated with attachment to sensual pleasures, clinging to desirable objects, lustful longing, the origination of desire, and the desires themselves.

source: དེ་ལ་འདོད་པ་རྣམས་ལ་ཉེས་དམིགས་སུ་ཤེས་པས་སྐྱོ་ཞིང་ཆོས་ཀྱི་བསམ་པ་བསྒོམ་པ་དང་། བསླབ་པ་འཛིན་པ་ལ་མངོན་པར་དགའ་བས་གནས་པར་བྱེད་དོ། །ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་བ་དང་། ཆོས་ཀྱི་ནོར་བསགས་པ་དང་། ཆོས་ཀྱི་སེམས་རྣམ་པར་དག་པ་དང་། ཆོས་ཀྱི་ལམ་དང་ཡང་དག་པར་ལྡན་པ་དང་། ཆོས་ལ་གཞོལ་བ་དག་ཏུ་འགྱུར་རོ།
en: Knowing the defects of desires, those beings will grow weary of them. They will cultivate attitudes that agree with the Dharma, joyfully abide by the trainings they uphold, pursue the Dharma, delight in the joy of the Dharma, accumulate a wealth of Dharma, develop pure mindsets that are in accord with the Dharma, genuinely follow the path of the Dharma, and devote themselves to it.

source: །དེ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ་ཆོས་རྗེས་སུ་དྲན་ཞིང་ཆོས་ཀྱི་རོའི་རྣམ་པར་སྨིན་པ་ཆོས་ཀྱིས་བརླན་པའི་སེམས་ཀྱིས་གནས་པ་དེ་དག་གང་དང་གང་དུ་རྣམ་པར་ལྟ་བར་བྱེད་པ་དེ་དང་དེར་ཕྱོགས་ཐམས་ཅད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་ཚོགས་ཆེན་པོའི་འཁོར་དང་བཅས་པ་མཐོང་བར་འགྱུར་རོ།
en: When they die, they will remember the Dharma, and the flavor of the Dharma will ripen in them. In whatever directions those beings who have lived with minds moistened by the Dharma look, they will see blessed buddhas who reside while teaching the Dharma in the company of great assemblies.

source: །ཆོས་ཐོས་པར་འགྱུར་རོ། །དེ་དག་ཆོས་དེ་ཐོས་པས་ཀྱང་ཡིད་མཆོག་ཏུ་རངས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ལྟ་བར་བྱེད་དོ།
en: They will hear the Dharma, and upon hearing it they will behold the thus-gone ones with very delighted minds.

source: །དེ་དག་འཆི་བའི་དུས་བྱས་ནས་ངན་སོང་སྤངས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་མ་ཡིན་པ་རྣམས་སུ་སྐྱེ་བ་དག་ཏུ་འགྱུར་རོ།
en: “After they die, they will leave the lower realms behind and be born within buddha realms in which a buddha is present.

source: །དེར་དེ་དག་ཡོན་ཏན་གྱིས་ཕྱུག་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ལ་མངོན་པར་དགའ་ཞིང་བསམ་གཏན་དང་མངོན་པར་ཤེས་པས་རྣམ་པར་རོལ་པ་བྱང་གྲོལ་གྱི་བདེ་བ་ཕུན་སུམ་ཚོགས་པ། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོས་བརྒྱན་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་མཛད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོན་ཏན་གྱིས་རྣམ་པར་བརྒྱན་པ་རྣམས་དང་ལྷན་ཅིག་འཕྲད་པར་འགྱུར་རོ། །དེར་དེ་དག་དང་ལྷན་ཅིག་ཕྲད་པས་དེ་དག་གི་བག་ཆགས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་རྣམས་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །དེར་དེ་དག་ཡོན་ཏན་དེ་ལྟ་བུ་དག་གིས་ཀྱང་ཤིན་ཏུ་བརྒྱན་པར་འགྱུར་ཏེ།
en: There, they will enjoy a wealth of qualities, self-control, and restraint. They will join the company of those who revel in the concentrations and the higher perceptions, those who are adorned with the perfect happiness of emancipation, with great love, and with great compassion, those who ripen all sentient beings, and those who are ornamented with the qualities of the buddhas. By coming into contact with them, the latent imprints of their afflictions that lead to rebirth will be exhausted, and they will be adorned with those same qualities.

source: དཔེར་ན་ཟ་མ་ཏོག་ལ་ལར་སྤོས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་དག་བཅུག་པར་གྱུར་ཅིང་།
en: It will be as when various fragrant substances are placed in a basket together with some ornaments.

source: ཟ་མ་ཏོག་དེར་ཡང་རྒྱན་རྣམ་པ་སྣ་ཚོགས་དག་གཞག་པར་གྱུར་ན་རིང་པོ་མི་ཐོགས་པར་དེ་དག་གི་དྲི་ཅི་འདྲ་བར་གོས་དང་རྒྱན་དེ་དག་ཀྱང་དེ་འདྲ་བའི་དྲི་རབ་ཏུ་འབྱིན་པར་བྱེད་དོ།
en: Before long, those ornaments will be permeated by those fragrances and will begin to emit the same scents.

source: །རིང་པོ་མི་ཐོགས་པར་སྤོས་ཀྱི་རྣམ་པ་དེ་དག་གིས་གོས་པར་ཡང་འགྱུར་ལ་ཁ་དོག་ཏུ་ཉེ་བར་འགྲོ་བར་ཡང་མི་འགྱུར་རོ།
en: Even though their colors are dissimilar, they will soon be suffused with those fragrant substances.

source: །ཀཽ་ཌི་ནྱ་དེ་བཞིན་དུ་སེམས་ཅན་གང་དག་འདོད་པ་རྣམས་ལ་ཉེས་དམིགས་སུ་ཤེས་པས་ཞེས་བྱ་བ་ནས་དེ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ་ཞེས་བྱ་བའི་བར་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ཞིང་དེ་དག་འཆི་བའི་དུས་བྱས་ནས་ངན་སོང་གསུམ་སྤངས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་མ་ཡིན་པ་རྣམས་སུ་སྐྱེ་བ་དག་ཏུ་འགྱུར་རོ།
en: Similarly, Kauṇḍinya, at the time of death, sentient beings who know the defects of desires will behold the buddhas.

source: །ཞེས་བྱ་བའི་བར་དང་། དེར་དེ་དག་ཡོན་ཏན་དེ་ལྟ་བུ་དག་གིས་ཀྱང་ཡང་དག་པར་བརྒྱན་པར་འགྱུར་ཏེ་ཞེས་བྱ་བའི་བར་དང་། དེ་དག་རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: After they die, they will leave behind the lower realms and be born within buddha realms in which a buddha is present. [. . .] There, they will be adorned with those same qualities, and before long they will awaken to unsurpassed and perfect buddhahood.

source: །ཀཽ་ཌི་ནྱ་དེ་ལྟ་བས་ན་བདག་གི་དོན་དང་། གཞན་གྱི་དོན་དང་། གཉི་གའི་དོན་ཡང་དག་པར་མཐོང་བའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་སྐྱེས་བུ་དམ་པ་དག་ལ་བསྟེན་པར་བྱའོ། །བསྙེན་པར་བྱའོ། །བསྙེན་བཀུར་བྱའོ།
en: “Therefore, Kauṇḍinya, the noble sons or daughters who correctly discern what will be of benefit to themselves, others, and both themselves and others should attend to, serve, and revere sacred beings.

source: །དེ་དག་ལ་ཡང་གང་འདོད་པ་རྣམས་ཀྱི་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བ་ཡོངས་སུ་དྲི་བར་བྱའོ།
en: They should also question them about the experience of desires, their defects, and the emancipation from them.

source: །དེར་དེ་དག་ཆོས་ཐོས་ནས་གང་གི་ཕྱིར་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་རོ།
en: Upon hearing the Dharma in those places, they will swiftly awaken to unsurpassed and perfect buddhahood.

source: །སྐྱེས་བུ་དམ་པ་རྣམས་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། རྐྱེན་གྱི་རྒྱལ་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། ད་ལྟར་འཇིག་རྟེན་དུ་སྟོན་པ་ང་བྱུང་ངོ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སོ་ཞེས་བྱ་བའི་བར་ཡིན་ཏེ། ང་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བཞེད་པ། སྡུག་བསྔལ་ཐམས་ཅད་ལས་རབ་ཏུ་ཐར་བར་བཞེད་པ། འདོད་པའི་སྐྱོན་ཐམས་ཅད་རབ་ཏུ་སྟོན་པར་བཞེད་པ་ཡིན་ནོ། །
en: The ‘sacred beings’ are the buddhas, the bodhisattvas, the circumstantial victors, the worthy ones, and myself—the Teacher who has now appeared in the world, the blessed Buddha. I wish to benefit all sentient beings, to completely liberate them from all their sufferings, and to fully reveal all the faults of desire.

source: དེ་བས་ན་འདིར་ཁྱེད་ཇི་སྙེད་ལྷགས་པ་ཐམས་ཅད་ང་གཞན་མ་ཡིན་པར་གསུང་བ། མི་མཉམ་པ་མེད་པར་གསུང་བ། བྱམས་པར་གསུང་བ། སྙིང་རྗེ་བར་གསུང་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་མཛད་པ་ལས་འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཉོན་ཅིག །
en: Therefore, all of you who have assembled here, listen well to the teaching on the defects of desires that I—the one who speaks without error, impartially, and with love and compassion and who benefits all sentient beings—reveal!

source: མཉན་ནས་ཀྱང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱོས་ཤིག་དང་། ཕྱིས་ངན་སོང་གསུམ་པོ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Upon hearing such a teaching, keep it well in mind, and later on you will be liberated from the three lower realms and swiftly awaken to unsurpassed and perfect buddhahood.”

source: །ཡང་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་གང་བདག་ཅག་གིས་སེམས་རྩེ་གཅིག་པས་ཐོས་པར་འགྱུར་བ་བཤད་དུ་གསོལ།
en: At that moment, all the sentient beings present throughout the entire buddha realm of Sahā exclaimed in unison, “Blessed One, please explain to us the defects of desires!

source: ཐོས་ནས་ཀྱང་སྟོབས་ཇི་ལྟ་བ་བཞིན་དུ་བསྒྲུབ་པར་བགྱི་ལགས་སོ།
en: We shall listen to this teaching one-pointedly and accomplish it in accordance with our strengths!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྐྱེན་བཞིས་སེམས་ཅན་དག་གི་འདོད་པ་རྣམས་འབྱུང་སྟེ།
en: The Blessed One then said, “The desires of sentient beings arise through four conditions.

source: བཞི་གང་ཞེ་ན།
en: What are the four?

source: གཟུགས་ཀྱི་འདོད་ཆགས་དང་། དབྱིབས་ཀྱི་འདོད་ཆགས་དང་། རེག་པའི་འདོད་ཆགས་དང་། རྣམ་པར་གྲོལ་བ་མ་ཡིན་པའི་རྩེ་བའི་འདོད་ཆགས་ཀྱིས་སོ།
en: They are (1) the attachment to form, (2) the attachment to shape, (3) the attachment to contact, and (4) the attachment to passionate frolicking.

source: །དེ་ལ་གཟུགས་ཀྱི་འདོད་ཆགས་གང་ཞེ་ན།
en: “What is meant by ‘attachment to form’?

source: གཟུགས་ཀྱི་འདོད་ཆགས་ཞེས་བྱ་བ་ནི་མཁས་པ་དུས་སུ་འབྱུང་བ་ཆེན་པོ་བཞི་དག་ལ་མཁས་པ་ནི་ཟད་པའི་ཚུལ་དང་། བདག་མེད་པའི་ཚུལ་དང་། སེམས་ཅན་མེད་པའི་ཚུལ་གྱིས་སོ་སོར་རྟོགས་པར་བྱེད་ན། འོན་ཀྱང་བྱིས་པ་ཕྱིན་ཅི་ལོག་ལ་ཡང་དག་པར་རྟེན་པ་རྣམས་ནི་རྣམ་པར་བརྟག་པ་དག་ལ་འདི་ནི་བུད་མེད་ཀྱི་གཟུགས་སོ། །འདི་ནི་སྐྱེས་པའི་གཟུགས་སོ།
en: The wise ones, at the appropriate times, investigate the four great elements in terms of their exhaustion, selflessness, and the absence of sentient beings.

source: །འདི་ནི་ངན་པའོ། །འདི་ནི་བཟང་པོའོ། །འདི་ནི་དགའ་བར་བྱེད་པའོ། །འདི་ནི་མི་འདོད་པའོ་ཞེས་ཉེ་བར་རྟོག་པར་བྱེད་དོ། །དེ་ལ་འདོད་པའི་སྐྱེས་བུ་སྨྱོན་པ་རྣམས་ནི་བུད་མེད་ཀྱི་གཟུགས་དག་མཐོང་ནས་དེ་ལ་མཚན་མར་འཛིན་པ་དག་ཡིན། མངོན་རྟགས་སུ་འཛིན་པ་དག་ཡིན་ནོ། །
en: On the other hand, immature beings who rely on mistaken views apprehend the objects they investigate with concepts such as ‘this is the body of a woman,’ ‘this is the body of a man,’ ‘this is bad,’ ‘this is good,’ ‘this is pleasant,’ or ‘this is undesirable.’ When men who are intoxicated by desire see the appearance of women, they fixate on attributes and signs.

source: དེ་ལ་དེ་དག་འདོད་པའི་གཞི་དང་། འདོད་པ་ལ་འདུན་པ་དང་། འདོད་པ་ལ་ལྷག་པར་ཆགས་པ་མ་བྱུང་བ་སྐྱེད་པར་བྱེད་པས་དེ་དག་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ།
en: They thereby generate the ground of desire, the inclination toward desire, and the strong attachment to desire that had not yet previously arisen, and their roots of virtue will therefore become corrupted.

source: །མཁས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤོང་བར་བྱེད་པར་འགྱུར་རོ། །ལུས་དང་། ངག་དང་། ཡིད་མ་བསྲུངས་པས་ཉེས་པར་སྤྱོད་པ་ཐམས་ཅད་དང་ཕྲད་པར་འགྱུར་རོ།
en: Those beings will be rejected by all the wise ones, and since they do not guard their body, speech, and mind, they will involve themselves in all sorts of unwholesome activities.

source: །དེ་དག་འདོད་པ་རྣམས་ལས་ངེས་པར་འབྱུང་བར་མི་ལྟ་ཞིང་ངན་སོང་གསུམ་དང་ཡང་དག་པར་ལྡན་པ་ཡིན་ཏེ།
en: They will not care about the emancipation from desires, and they will fall into the three lower realms.

source: འཆི་བའི་དུས་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་རྣམས་སམ། དུད་འགྲོ་རྣམས་སམ། ཡི་དགས་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: After they die, they will be born as hell beings, animals, or pretas.

source: །དེར་འདོད་པའི་རྒྱུ་དང་། འདོད་པའི་རྐྱེན་དང་། འདོད་པའི་གཞིས་དུས་ཡུན་རིང་པོར་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྩུབ་པ་ཚ་བ་མི་བཟད་པ་མྱོང་བར་འགྱུར་རོ།
en: Through the causes, the conditions, and the ground of such desires, they will experience harsh, scorching, and unbearable feelings of suffering in those places for a long time.

source: །དེར་མཁས་པ་རྣམས་ནི་བུད་མེད་དང་སྐྱེས་པར་ཤེས་ནས་མི་སྡུག་པའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དོ།
en: “While they know them to be women and men, the wise ones generate the perception of repulsiveness:

source: །སྐྲ་མེད་པ་དང་། པགས་ཤུན་དང་། རྒྱུས་པ་དང་། ཤ་དང་། ཁྲག་མེད་པ་དང་། རུས་པ་དང་། མིའི་ཐོད་པ་དཀར་པོ་ཡིད་ལ་བྱེད།
en: they imagine their absence of hair, their skin, their ligaments, their flesh, their absence of blood, their bones, and their white human skulls.

source: ཀུན་ཏུ་སྟེན་པར་བྱེད་ཅིང་དེ་སྒོམ་པར་བྱེད། ལན་མང་དུ་བྱེད་དོ། །
en: They pursue that process, cultivate it, and repeat it.

source: བུད་མེད་ཀྱི་གཟུགས་ལ་ཇི་ལྟ་བར་སྐྱེས་པའི་གཟུགས་ལའང་དེ་བཞིན་ནོ།
en: They apply the same process with respect to the physical forms of men as they do with respect to the physical forms of women.

source: །མདུན་དུ་ཇི་ལྟ་བར་ཐག་རིང་དུའང་དེ་བཞིན་ནོ།
en: They apply the same process with respect to what is far away as they do with respect to what is present in front of them.

source: །ཐག་རིང་དུ་ཇི་ལྟ་བུར་མདུན་དུའང་དེ་བཞིན་ནོ།
en: They apply the same process with respect to what is present in front of them as they do with respect to what is far away.

source: །གཞན་ཇི་ལྟ་བར་བདག་གི་ཡང་དེ་བཞིན་དུ་རུས་པའི་ཕུང་པོ་དཀར་པོ་དང་། སྐྲ་མེད་པ་དང་། པགས་ཤུན་དང་། རྒྱུས་པ་དང་། ཤ་དང་། ཁྲག་མེད་པར་ཡིད་ལ་བྱས་ཤིང་རིག་པར་བྱས་ལ།
en: Just as they do with others, they focus their attention and apply knowledge to their own white heaps of bones, their absence of hair, their skin, their ligaments, their flesh, and their lack of blood.

source: ལན་མང་དུ་བྱས་པས་དེར་སེམས་ཤིན་ཏུ་གནས་པ་ཡིན། ཤིན་ཏུ་བསྒོམས་པ་དང་། ཤིན་ཏུ་ཡིད་ལ་བྱས་པ་ཡིན་ཏེ།
en: By repeating that process many times, their minds become fully settled, trained, and focused.

source: འདི་ནི་སེམས་ཀྱི་ཉོན་མོངས་པའི་ཀློང་ཡང་དག་པར་གཅོད་པ་དང་པོའོ།
en: This is the first authentic elimination of the sphere of mental afflictions.

source: །ཡང་རུས་གོང་གི་ཕུང་པོ་དེ་ཉིད་ལ་སེམས་ཡང་དག་པར་གཏོད་པར་བྱེད་དེ། སྨིན་མཚམས་སུ་རྒྱ་ཤུག་ཙམ་དེ་ལ་དྲན་པ་གཞོག་པར་བྱེད་ཅིང་སེམས་སྒོམ་པར་བྱེད།
en: “Then, directing their attention on those heaps of bones, they apply their mindfulness to a spot about the size of a jujube fruit between their eyebrows.

source: ལན་མང་དུ་བྱེད་དོ་ཞེས་བྱ་བ་ནས་དེའི་སེམས་ཤིན་ཏུ་གནས་པ་ཡིན་ཏེ་ཤིན་ཏུ་བསྒོམས་པ་དང་། ཤིན་ཏུ་ཡིད་ལ་བྱས་པའི་བར་ཡིན་ནོ།
en: They meditate on this and repeat that process many times. [. . .] By doing so, their minds become fully settled, trained, and focused.

source: །དེ་ལ་དེའི་སེམས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན། ལུས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན་ཏེ།
en: Both their minds and bodies are utterly purified.

source: ཇི་ལྟར་སེམས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན་ཞེ་ན།
en: How is it that their minds are utterly purified?

source: ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་ཞི་བར་བྱེད་དོ།
en: Because they are pacified in all possible respects.

source: །དེ་ཅུང་ཟད་ཡིད་ལ་བྱེད་པ་ཡིན། དེ་ཅུང་ཟད་ཡང་དག་པར་ཤེས་པ་ཡིན། དེ་ཅུང་ཟད་དམིགས་པར་བྱེད་པ་ཡིན་ཏེ། འདི་ནི་ཞི་གནས་དང་རྗེས་སུ་འཐུན་པ་ཉོན་མོངས་པའི་ཀློང་རྣམ་པར་གཅོད་པ་དང་། འདོད་ཆགས་རྣམ་པར་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་གཉིས་པའོ།
en: Contemplating, cognizing, and observing this for a while is the second Dharma gateway, which accords with the practice of tranquility, eliminates attachment, and eliminates the sphere of afflictions.

source: །ཇི་ལྟར་ལུས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན་ཞེ་ན།
en: “Why is it that their bodies are utterly purified?

source: དེ་བཞིན་དུ་སྒོམ་པའི་དབུགས་རྔུབ་པ་དང་དབུགས་ཕྱུང་བ་རྣམ་པར་ཞི་བར་བྱེད་ཅིང་འཇུག་པར་ཡང་མི་བྱེད། འབྱུང་བར་མི་བྱེད་དོ།
en: Because, in a similar way, the inhalation and exhalation of their breath is interrupted in their meditation—they neither breathe in nor breathe out.

source: །དེ་ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་ཤིང་ཞི་གནས་ལ་རྗེས་སུ་བརྩོན་པ་འགོག་པ་ལ་དམིགས་པ་ཡིན་ཏེ།
en: With both their bodies and minds utterly purified, they exert themselves in tranquility and focus on cessation.

source: འདི་ནི་འགོག་པ་ལ་དམིགས་པའི་ཉོན་མོངས་པའི་ཀློང་རྣམ་པར་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་གསུམ་པ་ཡིན་ནོ།
en: This is the third Dharma gateway, which focuses on cessation and eliminates the sphere of afflictions.

source: །ཡང་གང་གི་སེམས་རྒོད་པ་མྱུར་དུ་ཞི་གནས་དང་འཐུན་པར་བྱུང་བ་དེ་མགོ་ཐོད་ཀྱི་མཚོགས་མར་རྒྱ་ཤུག་གི་འབྲས་བུ་ཙམ་ལ་གནས་གཅིག་ཏུ་སེམས་ཉེ་བར་གཏོད་པར་བྱེད་ཅིང་སྒོམ་པར་བྱེད། ལན་མང་དུ་བྱེད་དོ།
en: “Furthermore, the minds of those who are agitated can quickly become in accord with the practice of tranquility. For this, they should direct their attention to a spot about the size of a jujube fruit on the soft area at the top of their heads. They should then cultivate this and repeat the process many times.

source: །དེར་བུ་གའི་བར་དུ་མཐོང་བར་བྱེད་ཅིང་སྒོམ་པར་བྱེད། ལན་མང་དུ་བྱེད་དོ།
en: Next, they should visualize and cultivate this up to the fontanel and repeat the process many times.

source: །དེར་ཡང་བྱེ་མའི་འབྲུ་ཙམ་གྱི་རུས་གོང་གི་ཕྱེ་མར་བྱེད།
en: After that, they must visualize their bones on that spot being pulverized into dust about the size of sand grains.

source: མཐོང་བར་བྱེད་ཅིང་རིམ་པ་དེ་གཉིས་པ་དང་། གསུམ་པ་ཞེས་བྱ་བ་ནས་མགོའི་ཐོད་པ་ཐམས་ཅད་རུས་གོང་གི་ཕྱེ་མའི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: After the second and third stages, they continue up to the point at which they visualize their entire skull and all their bones being pulverized into dust.

source: །དེ་དག་ཀྱང་རླུང་གིས་ཁྱེར་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་པ་ནས་ཐམས་ཅད་ནམ་མཁའ་སྟོང་པ་ཉིད་དུ་མཐོང་བའི་བར་དུ་བྱེད་དོ།
en: They will then visualize that dust being blown away by the wind, until nothing but empty space remains.

source: །དེ་ལ་ལུས་ཤིན་ཏུ་སྦྱངས་པ་དང་། སེམས་ཤིན་ཏུ་སྦྱངས་པ་འདི་ནི་ཞི་གནས་ལ་རབ་ཏུ་བརྩོན་པ་དང་། འགོག་པ་ལ་དམིགས་པ་དང་། ཉོན་མོངས་པའི་ཀློང་རྣམ་པར་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་བཞི་པའོ།
en: In this way, both their bodies and minds become utterly purified. This is the fourth Dharma gateway, which strives in the practice of tranquility, focuses on cessation, and eliminates the sphere of afflictions.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཽ་ཌི་ནྱས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་ལགས། འདུས་བྱས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་མ་ཚང་བ་མ་མཆིས་པ་རྣམ་པར་དབེན་པའི་རྟེན་ནམ་མཁའི་དབྱིངས་ཀྱི་ཡང་དག་པའི་མཐའ་ཅན་ལགས་སམ།
en: Venerable Kauṇḍinya then asked, “Respected Blessed One, does the complete wisdom of the realm of the conditioned include the limit of reality of the realm of space, the ground of voidness?”

source: རིགས་ཀྱི་བུ་དེ་བཞིན་ནོ།
en: “Yes, noble son.

source: །འདུས་བྱས་ཀྱི་དབྱིངས་ཀྱི་ཡང་དག་པའི་མཐའ་ནི་ནམ་མཁའ་དང་འདྲ་སྟེ།
en: The limit of reality of the realm of the conditioned is like space;

source: འདི་ནི་ཡང་དག་པར་རང་གིས་མཐོང་བར་བྱ་བ་ལ་འཇུག་པའོ།
en: it pervades everything one sees.”

source: །ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་ལགས་ནམ་མཁའ་རང་གི་ཤེས་པ་ལགས་སམ། འོན་ཏེ་གཞན་གྱི་ཤེས་པ་ལ་མངོན་པར་འཇུག་པ་ལ་མཁས་པ་ལགས།
en: Ājñātakauṇḍinya then said, “Respected Blessed One, is space one’s own cognition, or does it pervade others’ cognition?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་ལ་འཇུག་པས་འདུས་བྱས་ཀྱི་དབྱིངས་ཐམས་ཅད་རང་གི་ཤེས་པ་ལ་འཇུག་པར་བྱའོ།
en: The Blessed One replied, “Since it pervades the realm of all phenomena, the entire realm of the conditioned must also pervade one’s own cognition.

source: །ཇི་ལྟ་ཞེ་ན།
en: Why is it so?

source: གང་གཟུགས་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་རྣམ་པར་སྒོམ་པར་བྱེད་པ་དེ་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར་རོ།
en: Those who meditate on the complete purity of form will behold the thus-gone ones.

source: །གང་མགོའི་ཐོད་པའི་རུས་པའི་ཕྱེ་མ་མཐོང་ནས་ཐམས་ཅད་རླུང་གིས་ཁྱེར་བར་མཐོང་བ་དེས་གཟུགས་ཐམས་ཅད་རྣམ་པར་བཤིག་པ་ཡིན་ཏེ། མིག་གི་རྣམ་པར་ཤེས་པ་ལ་གཟུགས་སུ་སྣང་བ་ཅི་ཡང་སྣང་བར་མི་འགྱུར་རོ།
en: Those who see the bones of the skull being pulverized into dust and blown away by the wind will destroy all forms, so that no material form will appear anymore to their eye consciousness.

source: །དེ་ནམ་མཁའ་སྟོང་པ་ཡིད་ལ་བྱེད་ཅིང་སྒོམ་པར་བྱེད། ལན་མང་དུ་བྱེད་དེ།
en: They focus their attention and meditate on empty space, and they do so repeatedly.

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་དུ་ནམ་མཁའ་བཻ་དཱུརྱའི་མདོག་ལྟར་དག་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: In all the directions and in between, they will perceive space that is pure like beryl;

source: །དེའི་ཡིད་ལ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་འབྱུང་སྟེ། དེས་ནམ་མཁའ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་མཐོང་ངོ་།
en: the appearance of the thus-gone ones will manifest in their minds, and they will see the appearance of the thus-gone ones within that space.

source: །དེ་གང་གི་ཚེ་ཕྱོགས་གང་དང་གང་དུ་ལྟ་བར་བྱེད་པའི་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་མཐོང་ངོ་།
en: When they look in any of the directions and in between, they will perceive the forms of the thus-gone ones.

source: །ཡང་དེ་བཞིན་གཤེགས་པའི་མཚན་གྱིས་བརྒྱན་པར་མིག་གི་རྣམ་པར་ཤེས་པ་འབྱུང་ངོ་།
en: The thus-gone ones, adorned with the excellent marks, will appear to their eye consciousness.

source: །དེ་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་དུ་གང་དང་གང་དུ་ལྟ་བར་བྱེད་པ་དེ་དང་དེ་ཉིད་དུ་སངས་རྒྱས་ཀྱི་སྐུ་རིལ་གྱིས་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ། འོད་འདོམ་གང་བ། ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་འབའ་ཞིག་མཐོང་ངོ་།
en: In whatever direction or intermediate direction they gaze, they will only see the bodies of buddhas fully adorned with the thirty-two major marks, surrounded by auras of light, and with circumferences like that of a banyan tree.
